docs/inclass02B.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 2B</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 2B</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2411edf">1. Instructions</a></li>
<li><a href="#orgee6034e">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2411edf" class="outline-2">
<h2 id="org2411edf"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider Liskov's Poly example, where an abstract Poly is defined as \(c_0 + c_1x + c_2x^2 + \dots\), and is implemented with two variables:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">private</span> <span style="color: #986801;">int</span> <span style="color: #6a1868;">deg</span>;
<span style="color: #e45649;">private</span> <span style="color: #986801;">int</span>[] <span style="color: #6a1868;">trms</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">Fill in example values that are mapped by the abstraction function.
Abstract Poly State:


What is a "state"?
A "state" is an assigment of values to variables


AF
/|\
|         5 + 3x^2
|
|
|----------------------------------------------------------
|
|
|
|        (-10, null)

(2, [5,0,3,0])  Liskov says "no"

(2, [5,0,3])  Liskov says "yes"


The "rep-invariant" describes which rep states are "yes"
1) trms != null
2) deg &gt;= 0
3) deg = trms.length - 1
4) and more - see Liskov

The rep-invariant defines the domain of the abstraction function



Representation State: (deg, trms)
</pre>
</div>

<ol class="org-ol">
<li>Identify representation states that should not be mapped.</li>
<li>Try to capture these states with a rule (that is, a rep-invariant).</li>
<li>Devise a representation that is suitable for a mutable version of Poly.</li>
<li>Develop a rep-invariant for that representation.</li>
</ol>
</div>
</div>

<div id="outline-container-orgee6034e" class="outline-2">
<h2 id="orgee6034e"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
